[M_IrisEp3_ChopSuey MissionDefinition]
MissionName="Chop Suey"
MissionDescription="Lacking a sponsor after Piston's betrayal, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]The Beatdown[-place] and find a new sponsor there.<br><br>As it turns out, a gladiator named Pyro Pete has kidnapped the sponsor you've been looking for. You started some trouble for him, so he has agreed to give you his sponsor. Simply go meet him, pretend to be surprised when he attempts to kill you, and then rescue the sponsor."

[M_IrisEp3_ChopSuey:MeetwithPyroPete MissionObjectiveDefinition]
ProgressMessage="''Meet'' Pyro Pete"

[M_IrisEp3_ChopSuey:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking a sponsor after Piston's betrayal, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]The Beatdown[-place] and find a new sponsor there.<br><br>As it turns out, a gladiator named Pyro Pete has kidnapped the sponsor you've been looking for. He's currently trying to kill you. You should probably kill him, and then rescue the sponsor he kidnapped."

[M_IrisEp3_ChopSuey:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking a sponsor after Piston's betrayal, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]The Beatdown[-place] and find a new sponsor there.<br><br>As it turns out, a gladiator named Pyro Pete had kidnapped the sponsor you'd been looking for. You killed him and now must rescue the sponsor he kidnapped."
